/*******************************************************************************
*
* 文件名称: Motor_Info.h
* 版 本 号: V1.0 
* 作    者: linbo.liu
* 生成日期: 2024年x月x日
* 功能描述: 
*
*******************************************************************************/
#ifndef _MOTOR_INFO_H_
#define _MOTOR_INFO_H_
/*******************************************************************************
 *-----------------------------------头文件-------------------------------------
 ******************************************************************************/
#include "App.h"

/*******************************************************************************
 *-----------------------------------宏定义-------------------------------------
 ******************************************************************************/


/*******************************************************************************
 *---------------------------------数据类型定义----------------------------------
 ******************************************************************************/
//角度高位、低位
typedef struct {
	uint8_t Raw_Angle_L;
	uint8_t Raw_Angle_H;
}RAW_ANGLE_T;

//原始角度联合体
typedef union {
	RAW_ANGLE_T xRaw_Angle;
	uint16_t usRaw_Angle;
}RAW_ANGLE_U;

typedef struct {
    uint16_t RawAngle;
    float M_CurAngle;
    float M_PreAngle;
    float E_Angle;
    uint16_t E_RawAngle;
    float Ro_Angle;
}ANGLE_Para_T;

typedef struct 
{
    float CurSpeed;
}SPEED_Para_T;



typedef struct {
    uint16_t   BUS_RawCurr ;       // 母线电流ADC
    uint32_t   U_RawCurr;          // U相电流ADC 
    uint32_t   V_RawCurr;          // V相电流ADC
    uint32_t   W_RawCurr;          // V相电流ADC

    uint16_t   BUS_Curr ;       // 母线电流ADC
    uint16_t   U_Curr;          // U相电流ADC 
    uint16_t   V_Curr;          // V相电流ADC
    uint16_t   W_Curr;          // V相电流ADC
    uint16_t   BUS_Voltage ;    // 母线电压ADC

    uint16_t   OffsetBUS_Curr ; // 母线电流偏移值ADC
    uint16_t   OffsetU_Curr;    // U相电流偏移值ADC 
    uint16_t   OffsetV_Curr;    // V相电流偏移值ADC
    uint16_t   OffsetW_Curr;    // V相电流偏移值ADC

    Boolean    ADC_InitCmp;
    Boolean    U_SampleCmp;
    Boolean    V_SampleCmp;
    Boolean    W_SampleCmp;
    Boolean    BUS_SampleCmp;
}ADC_PARA_T;

typedef struct {
    float   BUS_Curr ;      // 母线电流
    float   U_Curr;         // U相电流
    float   V_Curr;         // V相电流
    float   W_Curr;         // V相电流
    float   BUS_Voltage ;   // 母线电压
}VOLT_CURR_T;

typedef struct
{
    float  Ualpha; 	        // 二相静止坐标系alpha-轴
    float  Ubeta;	        // 二相静止坐标系beta-轴
    float  T[3];		    // 三相矢量占空比
    float  tmp[3];	        // 三相静止坐标系的电压temp1
    uint16_t SVPT[3];		// 归一化三相矢量占空比    
    uint16_t VecSector;	    // 矢量空间扇区号
}SVPWM_PARA_T;

/*******************************************************************************
 *-----------------------------------常量定义------------------------------------
 ******************************************************************************/


/*******************************************************************************
 *-----------------------——--------全局变量定义----------------------------------
 ******************************************************************************/


/*******************************************************************************
 *-----------------------------------函数接口------------------------------------
 ******************************************************************************/
void Get_MotorAngle(void);
void PWM_ParaInit(void);
void ADC_ParaInit(void);
void Angle_ParaInit(void);
void ADC_UVW_deal(void); 

/*******************************************************************************
 *---------------------------—----—--变量接口------------------------------------
 ******************************************************************************/
extern ADC_PARA_T g_ADCSampPara;
extern VOLT_CURR_T g_VoltCurrPara;
extern SVPWM_PARA_T g_SvPWMPara;
extern ANGLE_Para_T g_AnglePara;

#endif
/*******************************************************************************
 *---------------------------—----—---结束--------------------------------------
 ******************************************************************************/