/*******************************************************************************
*
* 文件名称: Motor_Para.h
* 版 本 号: V1.0 
* 作    者: linbo.liu
* 生成日期: 2024年x月x日
* 功能描述: 电机参数
*
*******************************************************************************/
#ifndef _Motor_para_H
#define _Motor_para_H
/*******************************************************************************
 *-----------------------------------头文件-------------------------------------
 ******************************************************************************/


/*******************************************************************************
 *-----------------------------------宏定义-------------------------------------
 ******************************************************************************/
#define MOTOR_PolePairs                         2       // 电机极对数
#define SPEED_SamplingTime                      0.000005// 采样时间 (秒)50us
#define Phase_Curr_Sensor_Range                 30      // 相电流传感器量程  
#define BUS_Curr_Sensor_Range                   30      // 母线电流传感器量程 
#define BUS_Voltage_Add_Coeff                   0.5f    // 母线电压加法系数
#define BUS_Voltage_Mult_Coeff                  0.017f  // 母线电压乘法系数
#define ANGLE_120                               1365           // 120/360*4096
#define Motor_MAX_Trq_NM                        50      // 电机最大扭矩 1NM 限制扭矩
#define Motor_MAX_Speed_RPM                     2700    // rpm 限制转速
#define BUS_CurrProtection                      3.0f    // 3A保护
#define BUS_Voltage_Min                         16.0f   // 16V保护
#define BUS_Voltage_Max                         48.0f   // 16V保护
#define Motor_Over_Speed_RPM                    1900    // rpm 限制转速
#define Motor_12Bit                             0XFFF
#define Protect_Low_Voltage_V                           // 低压保护
#define Standard_Work_Voltage_V                 24.0f   // 标准工作电压
#define Protect_High_Voltage_V                          // 高保护
#define Motor_Rs                                        // 相电阻 欧姆
#define Motor_Ld                                        // D轴电感
#define Motor_Lq                                        // Q轴电感
#define Motor_Flux                                      // 磁链
#define Sqrt_OF_3                               0.57735f
#define Svpwm_Km                                (Standard_Work_Voltage_V * Sqrt_OF_3)
#define Svpwm_Km_Backw                          0.144337f   // 倒数  1/(Standard_Work_Voltage_V*Sqrt_OF_3) 用于标幺化处理
#define Vdc_s                                   6.651       //  (Standard_Work_Voltage_V*Sqrt_OF_3*0.96)
#define PI_MAX_Ud                               6.373       //  (Standard_Work_Voltage_V*Sqrt_OF_3*0.92)   // 13.5
#define PI_MAX_Uq                               6.373       //  (Standard_Work_Voltage_V*Sqrt_OF_3*0.92)
#define PI_MAX_Id                               1.5f        // A
#define Control_Mode_Stop                       0           // 停机模式
#define Control_Mode_IF                         1
#define Control_Mode_Speed                      2           // 速度控制模式 正反转
#define VF_F_Grad_Timer                         60          // 定义电压的梯度时间
#define VF_F_Grad_0D1HZ                         0.1         // 定义电压的梯度值
#define Speed_Grad_Timer                        30          // 定义速度的梯度时间
#define Speed_Grad_RPM                          2           // 定义速度的梯度值
#define Idq_Grad_Timer                          50          // 定义电流的梯度时间
#define Idq_Grad_0D1A                           0.05        // 定义电流的梯度值
#define Motor_Freq_Min                          2           // 定义频率的最小值
#define Motor_Freq_Max                          80          // 定义频率最大值
#define MinSpeed_Grad                           10          // 最小划算转速分段
#define PHASE_Curr_max                          40          // 相线电流
#define BUS_Curr_max                            20          // 20A的母线电流
/*******************************************************************************
 *---------------------------------数据类型定义----------------------------------
 ******************************************************************************/


/*******************************************************************************
 *-----------------------------------常量定义------------------------------------
 ******************************************************************************/


/*******************************************************************************
 *-----------------------——--------全局变量定义----------------------------------
 ******************************************************************************/


/*******************************************************************************
 *-----------------------------------函数接口------------------------------------
 ******************************************************************************/


/*******************************************************************************
 *---------------------------—----—--变量接口------------------------------------
 ******************************************************************************/

#endif
/*******************************************************************************
 *---------------------------—----—---结束--------------------------------------
 ******************************************************************************/